nxp-appcodehub/dm-lpc860-smart-lighting/drivers/fsl_adc.h
    /* Indicates that a thre shold crossing in the upward direction has occurred - i.e. the previous sample on this
     * channel was below the threshold value established by the designated LOW threshold value and the current sample is
     * above that threshold. */
    kADC_ThresholdCrossingUpward = 3U, /*!< Upward Threshold Crossing Detected. */
} adc_threshold_crossing_status_t;

/*!
 * @brief Define interrupt mode for threshold compare event.
 */
typedef enum _adc_threshold_interrupt_mode
{
    kADC_ThresholdInterruptDisabled   = 0U, /*!< Threshold comparison interrupt is disabled. */
    kADC_ThresholdInterruptOnOutside  = 1U, /*!< Threshold comparison interrupt is enabled on outside threshold. */
    kADC_ThresholdInterruptOnCrossing = 2U, /*!< Threshold comparison interrupt is enabled on crossing threshold. */
} adc_threshold_interrupt_mode_t;

/*!
 * @brief Define the info result mode of different resolution.
 */
typedef enum _adc_inforesultshift
{
    kADC_Resolution12bitInfoResultShift = 0U, /*!< Info result shift of Resolution12bit. */
    kADC_Resolution10bitInfoResultShift = 2U, /*!< Info result shift of Resolution10bit. */
    kADC_Resolution8bitInfoResultShift  = 4U, /*!< Info result shift of Resolution8bit. */
    kADC_Resolution6bitInfoResultShift  = 6U, /*!< Info result shift of Resolution6bit. */
} adc_inforesult_t;

/*!
 * @brief Define common modes for Temerature sensor.
 */
typedef enum _adc_tempsensor_common_mode
{
    kADC_HighNegativeOffsetAdded = 0x0U, /*!< Temperature sensor common mode: high negative offset added. */
    kADC_IntermediateNegativeOffsetAdded =
        0x4U,                           /*!< Temperature sensor common mode: intermediate negative offset added. */
    kADC_NoOffsetAdded          = 0x8U, /*!< Temperature sensor common mode: no offset added. */
    kADC_LowPositiveOffsetAdded = 0xcU, /*!< Temperature sensor common mode: low positive offset added. */
} adc_tempsensor_common_mode_t;

/*!
 * @brief Define source impedance modes for GPADC control.
 */
typedef enum _adc_second_control
{
    kADC_Impedance621Ohm = 0x1U << 9U, /*!< Extand ADC sampling time according to source impedance 1: 0.621 kOhm. */
    kADC_Impedance55kOhm =
        0x14U << 9U, /*!< Extand ADC sampling time according to source impedance 20 (default): 55 kOhm. */
    kADC_Impedance87kOhm = 0x1fU << 9U, /*!< Extand ADC sampling time according to source impedance 31: 87 kOhm. */

    kADC_NormalFunctionalMode = 0x0U << 14U, /*!< TEST mode: Normal functional mode. */
    kADC_MultiplexeTestMode   = 0x1U << 14U, /*!< TEST mode: Multiplexer test mode. */
    kADC_ADCInUnityGainMode   = 0x2U << 14U, /*!< TEST mode: ADC in unity gain mode. */
} adc_second_control_t;

/*!
 * @brief Define structure for configuring the block.
 */
typedef struct _adc_config
{
#if defined(FSL_FEATURE_ADC_HAS_CTRL_ASYNMODE) & FSL_FEATURE_ADC_HAS_CTRL_ASYNMODE
    adc_clock_mode_t clockMode;  /*!< Select the clock mode for ADC converter. */
#endif                           /* FSL_FEATURE_ADC_HAS_CTRL_ASYNMODE. */
    uint32_t clockDividerNumber; /*!< This field is only available when using kADC_ClockSynchronousMode for "clockMode"
                                      field. The divider would be plused by 1 based on the value in this field. The
                                      available range is in 8 bits. */
#if defined(FSL_FEATURE_ADC_HAS_CTRL_RESOL) & FSL_FEATURE_ADC_HAS_CTRL_RESOL
    adc_resolution_t resolution; /*!< Select the conversion bits. */
#endif                           /* FSL_FEATURE_ADC_HAS_CTRL_RESOL. */
#if defined(FSL_FEATURE_ADC_HAS_CTRL_BYPASSCAL) & FSL_FEATURE_ADC_HAS_CTRL_BYPASSCAL
    bool enableBypassCalibration; /*!< By default, a calibration cycle must be performed each time the chip is
                                       powered-up. Re-calibration may be warranted periodically - especially if
                                       operating conditions have changed. To enable this option would avoid the need to
                                       calibrate if offset error is not a concern in the application. */
#endif                            /* FSL_FEATURE_ADC_HAS_CTRL_BYPASSCAL. */
#if defined(FSL_FEATURE_ADC_HAS_CTRL_TSAMP) & FSL_FEATURE_ADC_HAS_CTRL_TSAMP
    uint32_t sampleTimeNumber; /*!< By default, with value as "0U", the sample period would be 2.5 ADC clocks. Then,
                                    to plus the "sampleTimeNumber" value here. The available value range is in 3 bits.*/
#endif                         /* FSL_FEATURE_ADC_HAS_CTRL_TSAMP. */
#if defined(FSL_FEATURE_ADC_HAS_CTRL_LPWRMODE) & FSL_FEATURE_ADC_HAS_CTRL_LPWRMODE
    bool enableLowPowerMode; /*!< If disable low-power mode, ADC remains activated even when no conversions are
                              requested.
                              If enable low-power mode, The ADC is automatically powered-down when no conversions are
                              taking place. */
#endif                       /* FSL_FEATURE_ADC_HAS_CTRL_LPWRMODE. */
#if defined(FSL_FEATURE_ADC_HAS_TRIM_REG) & FSL_FEATURE_ADC_HAS_TRIM_REG
    adc_vdda_range_t
        voltageRange; /*!<  Configure the ADC for the appropriate operating range of the analog supply voltage VDDA.
                            Failure to set the area correctly causes the ADC to return incorrect conversion results. */
#endif                /* FSL_FEATURE_ADC_HAS_TRIM_REG. */
} adc_config_t;

/*!
 * @brief Define structure for configuring conversion sequence.
 */
typedef struct _adc_conv_seq_config
{
    uint32_t channelMask; /*!< Selects which one or more of the ADC channels will be sampled and converted when this
             sequence is launched. The masked channels would be involved in current conversion
             sequence, beginning with the lowest-order. The available range is in 12-bit. */
    uint32_t triggerMask; /*!< Selects which one or more of the available hardware trigger sources will cause this
             conversion sequence to be initiated. The available range is 6-bit.*/
    adc_trigger_polarity_t triggerPolarity; /*!< Select the trigger to launch conversion sequence. */
    bool enableSyncBypass; /*!< To enable this feature allows the hardware trigger input to bypass synchronization
               flip-flop stages and therefore shorten the time between the trigger input signal and the
               start of a conversion. */
    bool enableSingleStep; /*!< When enabling this feature, a trigger will launch a single conversion on the next
               channel in the sequence instead of the default response of launching an entire sequence
               of conversions. */
    adc_seq_interrupt_mode_t interruptMode; /*!< Select the interrpt/DMA trigger mode. */
#if defined(FSL_FEATURE_ADC_HAS_SEQ_CTRL_TSAMP) & FSL_FEATURE_ADC_HAS_SEQ_CTRL_TSAMP
    uint8_t seqSampleTimeNumber; /*!< Conversion sequence sampling time.*/
#endif                            /* FSL_FEATURE_ADC_HAS_SEQ_CTRL_TSAMP */
} adc_conv_seq_config_t;

/*!
 * @brief Define structure of keeping conversion result information.
 */
typedef struct _adc_result_info
{
    uint32_t result;                                         /*!< Keep the conversion data value. */
    adc_threshold_compare_status_t thresholdCompareStatus;   /*!< Keep the threshold compare status. */
    adc_threshold_crossing_status_t thresholdCorssingStatus; /*!< Keep the threshold crossing status. */
    uint32_t channelNumber;                                  /*!< Keep the channel number for this conversion. */
    bool overrunFlag; /*!< Keep the status whether the conversion is overrun or not. */
    /* The data available flag would be returned by the reading result API. */
} adc_result_info_t;

#if defined(__cplusplus)
extern "C" {
#endif

